AccumulationRegisters/КомплектыУПодрядчика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>КомплектыУПодрядчика</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подрядчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИзделиеКомплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

CommonModules/омПодрядчики/Ext/Module.bsl
Функция КомплектыУПодрядчика(ПараметрыВозврата = Неопределено) Экспорт

	
	Если ПараметрыВозврата = Неопределено Тогда
		
		ПараметрыВозврата = Новый Структура();
		
		ПараметрыВозврата.Вставить("ДатыОбещания", 	Истина);
		ПараметрыВозврата.Вставить("ДатыОтправки",	Истина);
	    ПараметрыВозврата.Вставить("МестоВозврата",	Истина); 
		ПараметрыВозврата.Вставить("Проект",		Неопределено);
		ПараметрыВозврата.Вставить("Подрядчик",		Неопределено);
		ПараметрыВозврата.Вставить("ДатаРасчета", 	Дата(1, 1, 1));
		ПараметрыВозврата.Вставить("НаТекущуюДату", Истина)
		
	КонецЕсли; 
	
	ДанныеЗапроса = ПолучитьДанныеЗапроса(ПараметрыВозврата);

КонецФункции // КомплектыУПодрядчика()


Функция ПолучитьПустыеПараметрыДляПолученияКомплектовУПодрядчика() Экспорт

    Возврат Новый Структура("НаТекущуюДату, ДатыОбещания, ДатыОтправки, МестоВозврата, Проект, Подрядчик, ДатаРасчета"
							, Истина
							, Ложь
							, Ложь
							, Ложь
							, Неопределено
							, Неопределено 
							, Дата(1, 1, 1)
							);
	
КонецФункции // ПолучитьПустыеПараметрыДляПолученияКомплектовУПодрядчика()


Функция ПолучитьДанныеЗапроса(ПараметрыВозврата)
	
	КоличествоПакетов = 0;

	Запрос = Новый Запрос;
    //Если изменяется текст запроса необходимо изменить шаблон в функциях СтрЗаменить
	Запрос.Текст =  "ВЫБРАТЬ
	|	КомплектыУПодрядчикаОстатки.Подрядчик КАК Подрядчик,
	|	КомплектыУПодрядчикаОстатки.ИзделиеКомплект КАК ИзделиеКомплект
	|ИЗ
	|	РегистрНакопления.КомплектыУПодрядчика.Остатки(
	|			&ДатаРасчета, Подрядчик = &Подрядчик И ИзделиеКомплект.Проект = &Проект) КАК КомплектыУПодрядчикаОстатки
	|ГДЕ
	|	КомплектыУПодрядчикаОстатки.КоличествоОстаток > 0";
	

	Если ПараметрыВозврата.НаТекущуюДату Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДатаРасчета", ""); 
	Иначе	
	    Запрос.УстановитьПараметр("ДатаРасчета", ПараметрыВозврата.ДатаРасчета); 
	КонецЕсли;
	
	Если НЕ (ПараметрыВозврата.Проект = Неопределено ИЛИ ПараметрыВозврата.Подрядчик = Неопределено) Тогда
	    Запрос.УстановитьПараметр("Проект", ПараметрыВозврата.Проект); 
	    Запрос.УстановитьПараметр("Подрядчик", ПараметрыВозврата.Подрядчик); 
	ИначеЕсли НЕ ПараметрыВозврата.Подрядчик = Неопределено  Тогда	
	    Запрос.УстановитьПараметр("Подрядчик", ПараметрыВозврата.Подрядчик); 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ИзделиеКомплект.Проект = &Проект", ""); 
	ИначеЕсли НЕ ПараметрыВозврата.Проект = Неопределено  Тогда	
	    Запрос.УстановитьПараметр("Проект", ПараметрыВозврата.Проект); 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Подрядчик = &Подрядчик И ", ""); 
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, " Подрядчик = &Подрядчик И ИзделиеКомплект.Проект = &Проект", ""); 
	КонецЕсли;
	
	//"ВЫБРАТЬ
	//|	КомплектыУПодрядчикаОстатки.ИзделиеКомплект КАК ИзделиеКомплект,
	//|	КомплектыУПодрядчикаОстатки.КоличествоОстаток КАК КоличествоОстаток,
	//|	КомплектыУПодрядчикаОстатки.Подрядчик КАК Подрядчик
	//|ПОМЕСТИТЬ вт
	//|ИЗ
	//|	РегистрНакопления.КомплектыУПодрядчика.Остатки(
	//|			&ДатаРасчета,
	//|			Подрядчик = &Подрядчик
	//|				И ИзделиеКомплект.Сделка = &Сделка) КАК КомплектыУПодрядчикаОстатки
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	КомплектыУПодрядчика.ВозвратНаСклад КАК ВозвратНаСклад,
	//|	КомплектыУПодрядчика.ДатаВозврата КАК ДатаВозврата
	//|ИЗ
	//|	РегистрНакопления.КомплектыУПодрядчика КАК КомплектыУПодрядчика
	//|ГДЕ
	//|	КомплектыУПодрядчика.Подрядчик В(&Подрядчик)
	//|	И КомплектыУПодрядчика.ИзделиеКомплект.Сделка В(&Сделка)"	
	Возврат Новый Структура("Запрос, КоличествоПакетов", Запрос, КоличествоПакетов);
	
КонецФункции // ПролучитьТекстЗапроса()
